[
{"title": "Software Development Engineer , AWS Kubernetes (K8s)", "url": "https://www.amazon.jobs/jobs/2938932", "location": "Santa Clara, CA, USA", "updated": "Updated: 3/26/2025", "short_description": ["Utility Computing (UC)AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently"], "job_id": "Job ID: 2938932 | Amazon Development Center U.S., Inc.", "full_description": "Utility Computing (UC)AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.Our software developers build the next generation technologies that change how millions of AWS customers connect, and interact with AWS services ecosystem. We use ideas from every facet of computer science including distributed computing, large-scale design, service oriented architecture & networking, We are looking for highly-motivated and passionate engineers to build next generation of network management for one of the largest networks in the world. As a software engineer in Elastic Kubernetes Service (EKS), you will be solving unique distributed computing and automation challenges prevalent in our network. The software services have unprecedented scale and availability requirements. You will get to work on brand new software products and distributed applications that deploy changes to thousands of nodes every day flawlessly without requiring human supervision. About the TeamOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.Diverse Experiences AWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.About AWS Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.Inclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.Work/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.Mentorship & Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.10017Key job responsibilitiesAs a member of the EKS Networking team, you will get to actively contribute to open source projects such as AWS VPC CNI, eBPF based network policy, AWS load balancer controller and work on next generation eBPF based network observability and telemetry. Additionally you will get to work with exceptional team members and be directly involved in growing and mentoring junior engineers on the team. ", "basic_qual": "Utility Computing (UC)AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.Our software developers build the next generation technologies that change how millions of AWS customers connect, and interact with AWS services ecosystem. We use ideas from every facet of computer science including distributed computing, large-scale design, service oriented architecture & networking, We are looking for highly-motivated and passionate engineers to build next generation of network management for one of the largest networks in the world. As a software engineer in Elastic Kubernetes Service (EKS), you will be solving unique distributed computing and automation challenges prevalent in our network. The software services have unprecedented scale and availability requirements. You will get to work on brand new software products and distributed applications that deploy changes to thousands of nodes every day flawlessly without requiring human supervision. About the TeamOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.Diverse Experiences AWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.About AWS Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.Inclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.Work/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.Mentorship & Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.10017Key job responsibilitiesAs a member of the EKS Networking team, you will get to actively contribute to open source projects such as AWS VPC CNI, eBPF based network policy, AWS load balancer controller and work on next generation eBPF based network observability and telemetry. Additionally you will get to work with exceptional team members and be directly involved in growing and mentoring junior engineers on the team. ", "preferred_qual": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Senior Software Developer, Item Relationships", "url": "https://www.amazon.jobs/jobs/2925443", "location": "Seattle, WA, USA", "updated": "Updated: 3/26/2025", "short_description": ["Have you ever wondered how the Amazon product detail page works? How all of a product’s variations (e.g. size, color, etc.) show up on a single page? Do you want to work on a product catalog with billions"], "job_id": "Job ID: 2925443 | Amazon.com Services LLC", "full_description": "Have you ever wondered how the Amazon product detail page works? How all of a product’s variations (e.g. size, color, etc.) show up on a single page? Do you want to work on a product catalog with billions of items and have a direct impact on hundreds of millions of Amazon customers?Join the Item Relationships team. You will get to:* Analyze and implement machine learning algorithms for identifying relationships between each of billions of products.* Design and develop intuitive solutions that will help customers make better informed buying decisions.* Automate complex analysis critical to the quality and coherence of Amazon’s enormous product catalog.* Manage a constant stream of inbound product data from millions of merchants, suppliers, and partners worldwide.* Leverage Amazon Web Services to create highly available, low-latency services upon which the whole of Amazon will depend.    We own the complete pipeline for our software, from gathering requirements to development and testing to deployment and availability. We are providing solutions to problems that have no prior art, on a scale that exceeds that of most companies on the planet. Come be a part of a foundational team and make changes with substantial impact.Every day we are working hard, having fun and making history - we would love for you to work with us. If you have what we are looking for, come join a strong team in a highly visible organization. Your impact on our software will be felt around the world.Successful candidates will be innovative, flexible, and self-directed. They will be able to work both independently and collaboratively with cross-functional business and software development teams to solve critical business problems. They will be comfortable taking initiative and working alongside top-notch software developers.", "basic_qual": "Have you ever wondered how the Amazon product detail page works? How all of a product’s variations (e.g. size, color, etc.) show up on a single page? Do you want to work on a product catalog with billions of items and have a direct impact on hundreds of millions of Amazon customers?Join the Item Relationships team. You will get to:* Analyze and implement machine learning algorithms for identifying relationships between each of billions of products.* Design and develop intuitive solutions that will help customers make better informed buying decisions.* Automate complex analysis critical to the quality and coherence of Amazon’s enormous product catalog.* Manage a constant stream of inbound product data from millions of merchants, suppliers, and partners worldwide.* Leverage Amazon Web Services to create highly available, low-latency services upon which the whole of Amazon will depend.    We own the complete pipeline for our software, from gathering requirements to development and testing to deployment and availability. We are providing solutions to problems that have no prior art, on a scale that exceeds that of most companies on the planet. Come be a part of a foundational team and make changes with substantial impact.Every day we are working hard, having fun and making history - we would love for you to work with us. If you have what we are looking for, come join a strong team in a highly visible organization. Your impact on our software will be felt around the world.Successful candidates will be innovative, flexible, and self-directed. They will be able to work both independently and collaboratively with cross-functional business and software development teams to solve critical business problems. They will be comfortable taking initiative and working alongside top-notch software developers.", "preferred_qual": "- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Software Development Engineer ", "url": "https://www.amazon.jobs/jobs/2874250", "location": "Sunnyvale, CA, USA", "updated": "Updated: 3/26/2025", "short_description": ["\nWant to teach machines to search for needles in a haystack? Ever wonder how you can keep the world’s largest selection also the world’s safest and legally compliant selection? Then come join a team with"], "job_id": "Job ID: 2874250 | Amazon.com Services LLC", "full_description": " Want to teach machines to search for needles in a haystack? Ever wonder how you can keep the world’s largest selection also the world’s safest and legally compliant selection? Then come join a team with the charter to monitor and classify the billions of items in the Amazon catalog to ensure compliance with various legal regulations. The Classification and Policy Platform team is looking for outstanding Software Development Engineers to build technology to automatically monitor the billions of products on the Amazon platform. The software and processes built by this team are a critical component of building a catalog that our customers trust.  You will have an opportunity to work with cutting edge machine learning algorithms on large datasets. You will need to build Amazon scale applications running on Amazon Cloud that both leverage and create new technologies to process large volumes of data that derive patterns and conclusions from the data.", "basic_qual": " Want to teach machines to search for needles in a haystack? Ever wonder how you can keep the world’s largest selection also the world’s safest and legally compliant selection? Then come join a team with the charter to monitor and classify the billions of items in the Amazon catalog to ensure compliance with various legal regulations. The Classification and Policy Platform team is looking for outstanding Software Development Engineers to build technology to automatically monitor the billions of products on the Amazon platform. The software and processes built by this team are a critical component of building a catalog that our customers trust.  You will have an opportunity to work with cutting edge machine learning algorithms on large datasets. You will need to build Amazon scale applications running on Amazon Cloud that both leverage and create new technologies to process large volumes of data that derive patterns and conclusions from the data.", "preferred_qual": "- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Software Development Engineer , Amazon Middle Mile Transportation", "url": "https://www.amazon.jobs/jobs/2908867", "location": "Bellevue, WA, USA", "updated": "Updated: 3/26/2025", "short_description": ["We’re on the lookout for the curious, those who think big and want to define the world of tomorrow. At Amazon, you will grow into the high impact, strategic person you know you’re ready to be. Every day"], "job_id": "Job ID: 2908867 | Amazon.com Services LLC", "full_description": "We’re on the lookout for the curious, those who think big and want to define the world of tomorrow. At Amazon, you will grow into the high impact, strategic person you know you’re ready to be. Every day will be filled with exciting new challenges, developing new skills, and achieving personal growth. How often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.Do you want to solve business challenges through innovative technology? Do you enjoy working on  large scale services in a team environment? Do you like working on industry-defining projects that move the needle?At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our Software Development Engineers (SDEs) use latest technology to solve complex problems and get to see the impact of their work first-hand.Key job responsibilities• Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.• Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.• Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.• Design and code the right solutions starting with broadly defined problems.• Work in an agile environment to deliver high-quality software.A day in the lifeThe challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world. We are looking for individuals who are passionate about creating new products, features, and services from scratch while managing ambiguity and the pace of a company where development cycles are measured in weeks, not years.About the teamInclusive Team CultureWe’re looking for a new teammate who is enthusiastic, empathetic, curious, motivated, reliable, and able to work effectively with a diverse team of peers; someone who will help us amplify the positive & inclusive team culture we’ve been building.", "basic_qual": "We’re on the lookout for the curious, those who think big and want to define the world of tomorrow. At Amazon, you will grow into the high impact, strategic person you know you’re ready to be. Every day will be filled with exciting new challenges, developing new skills, and achieving personal growth. How often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.Do you want to solve business challenges through innovative technology? Do you enjoy working on  large scale services in a team environment? Do you like working on industry-defining projects that move the needle?At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our Software Development Engineers (SDEs) use latest technology to solve complex problems and get to see the impact of their work first-hand.Key job responsibilities• Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.• Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.• Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.• Design and code the right solutions starting with broadly defined problems.• Work in an agile environment to deliver high-quality software.A day in the lifeThe challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world. We are looking for individuals who are passionate about creating new products, features, and services from scratch while managing ambiguity and the pace of a company where development cycles are measured in weeks, not years.About the teamInclusive Team CultureWe’re looking for a new teammate who is enthusiastic, empathetic, curious, motivated, reliable, and able to work effectively with a diverse team of peers; someone who will help us amplify the positive & inclusive team culture we’ve been building.", "preferred_qual": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Salesforce Developer, Amazon Retail Salesforce Team", "url": "https://www.amazon.jobs/jobs/2938912", "location": "Seattle, WA, USA", "updated": "Updated: 3/26/2025", "short_description": ["The North America Stores Salesforce Team is looking for a smart, motivated, and hard-working Salesforce Developer. This role will own a portfolio of integrations for a two-year-old Salesforce instance"], "job_id": "Job ID: 2938912 | Amazon Retail LLC - D79", "full_description": "The North America Stores Salesforce Team is looking for a smart, motivated, and hard-working Salesforce Developer. This role will own a portfolio of integrations for a two-year-old Salesforce instance supporting Amazon Retail teams. This is a high visibility project building new integrations in Salesforce for one of Amazon's largest businesses. In this role you will be responsible for designing and implementing integrations between Salesforce and third-party or Amazon (AWS) systems, ensuring we make the right tradeoffs to move quickly while maintaining a high bar for customers. You will build highly secured, scalable, extendable, and performant solutions. Working closely with product and tech teams, you will design, build, test, iterate and deploy new features, system integrations, and enhancements to existing features. Finally, you will provide key operational support to the team, playing a leading role in code reviews and guiding junior resources towards better designs and clean, standardized coding.Key job responsibilities- Own a portfolio of Integrations between internal Amazon systems and the Retail Salesforce instance. - Provide strategic leadership around the continuous evolution of Salesforce instance: Contribute to the platform vision and make sure that it aligns with the overall organizational direction and vision. Be an expert on the technology, the business, and external trends.- Be a champion of development and operational excellence: establish team metrics for measurement of performance excellence and a consistent, regular process for assessment and improvement.- Responsible for development standards for developing in Visualforce, Apex, Java, Lightning Components, and other technologies to build customized solutions that support business requirements and drive key business decision.- Raise the bar on technical excellence, show thought leadership, and communicate well to different audiences.- Mentor a team of Salesforce Admins.About the teamNAC ACES is focused on improving the employee and vendor experience across Amazon's NAC Retail organization. We deliver tooling, process improvements, and BI solutions to remove manual work and improve efficiency. We make it easier for our vendors to work with Amazon by resolving major pain points and delivering programs to improve the vendor experience. ", "basic_qual": "The North America Stores Salesforce Team is looking for a smart, motivated, and hard-working Salesforce Developer. This role will own a portfolio of integrations for a two-year-old Salesforce instance supporting Amazon Retail teams. This is a high visibility project building new integrations in Salesforce for one of Amazon's largest businesses. In this role you will be responsible for designing and implementing integrations between Salesforce and third-party or Amazon (AWS) systems, ensuring we make the right tradeoffs to move quickly while maintaining a high bar for customers. You will build highly secured, scalable, extendable, and performant solutions. Working closely with product and tech teams, you will design, build, test, iterate and deploy new features, system integrations, and enhancements to existing features. Finally, you will provide key operational support to the team, playing a leading role in code reviews and guiding junior resources towards better designs and clean, standardized coding.Key job responsibilities- Own a portfolio of Integrations between internal Amazon systems and the Retail Salesforce instance. - Provide strategic leadership around the continuous evolution of Salesforce instance: Contribute to the platform vision and make sure that it aligns with the overall organizational direction and vision. Be an expert on the technology, the business, and external trends.- Be a champion of development and operational excellence: establish team metrics for measurement of performance excellence and a consistent, regular process for assessment and improvement.- Responsible for development standards for developing in Visualforce, Apex, Java, Lightning Components, and other technologies to build customized solutions that support business requirements and drive key business decision.- Raise the bar on technical excellence, show thought leadership, and communicate well to different audiences.- Mentor a team of Salesforce Admins.About the teamNAC ACES is focused on improving the employee and vendor experience across Amazon's NAC Retail organization. We deliver tooling, process improvements, and BI solutions to remove manual work and improve efficiency. We make it easier for our vendors to work with Amazon by resolving major pain points and delivering programs to improve the vendor experience. ", "preferred_qual": "- Experience with distributed systems at scale- Bachelor's degree in computer science or equivalent- Proficiency in related integration technologies (JSON, XML, REST, SOAP)Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $116,300/year in our lowest geographic market up to $201,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Software Development Engineer, CreativeX", "url": "https://www.amazon.jobs/jobs/2931274", "location": "New York, NY, USA", "updated": "Updated: 3/26/2025", "short_description": ["The CreativeX RAPID(Real-time Ad Personalization & Insights Development) team is seeking passionate and talented MLE to join us. CreativeX is on a mission to enable brands of all sizes and categories to"], "job_id": "Job ID: 2931274 | Amazon.com Services LLC", "full_description": "The CreativeX RAPID(Real-time Ad Personalization & Insights Development) team is seeking passionate and talented MLE to join us. CreativeX is on a mission to enable brands of all sizes and categories to create, serve, measure, and optimize creative content with ease.  Our team is responsible for tailoring the visual experience of ads to each context in real-time, leveraging nouvelle technologies such as latent diffusion models, large language models (LLM), reinforced learning (RL), computer vision, and related methods.Our mission is to provide engaging, dynamically optimized creatives with low latencies both on and off Amazon for self-service brand advertisers. We automate the customization of product creatives with real-time catalog data while providing advertisers with the flexibility to customize their creatives according to their preferences.Key job responsibilities-  Quickly acquire knowledge of nouvelle technologies in Generative AI to solve complex problems in the Dynamic Creative Optimization (DCO) domain.  - Investigate design approaches, prototype new technologies, and evaluate their technical feasibility, such as Auto ML, real-time ML serving systems.- Collaborate with scientists to design and build data pipelines for processing massive datasets and scaling machine learning models.- Develop and maintain platforms for developing, evaluating, and deploying machine learning models for real-world applications.", "basic_qual": "The CreativeX RAPID(Real-time Ad Personalization & Insights Development) team is seeking passionate and talented MLE to join us. CreativeX is on a mission to enable brands of all sizes and categories to create, serve, measure, and optimize creative content with ease.  Our team is responsible for tailoring the visual experience of ads to each context in real-time, leveraging nouvelle technologies such as latent diffusion models, large language models (LLM), reinforced learning (RL), computer vision, and related methods.Our mission is to provide engaging, dynamically optimized creatives with low latencies both on and off Amazon for self-service brand advertisers. We automate the customization of product creatives with real-time catalog data while providing advertisers with the flexibility to customize their creatives according to their preferences.Key job responsibilities-  Quickly acquire knowledge of nouvelle technologies in Generative AI to solve complex problems in the Dynamic Creative Optimization (DCO) domain.  - Investigate design approaches, prototype new technologies, and evaluate their technical feasibility, such as Auto ML, real-time ML serving systems.- Collaborate with scientists to design and build data pipelines for processing massive datasets and scaling machine learning models.- Develop and maintain platforms for developing, evaluating, and deploying machine learning models for real-world applications.", "preferred_qual": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Software Development Engineer – Big Data, AWS Elastic MapReduce (EMR), EMR EKS", "url": "https://www.amazon.jobs/jobs/2938876", "location": "East Palo Alto, CA, USA", "updated": "Updated: 3/26/2025", "short_description": ["Internal Phone Tool titleSoftware Dev Engineer IIJob posting categorySoftware DevelopmentJob display languageEnglish (US)External job descriptionJob summaryWant to change the world with Big Data and Analytics?"], "job_id": "Job ID: 2938876 | Amazon Development Center U.S., Inc.", "full_description": "Internal Phone Tool titleSoftware Dev Engineer IIJob posting categorySoftware DevelopmentJob display languageEnglish (US)External job descriptionJob summaryWant to change the world with Big Data and Analytics? Come join us on the Amazon Web services (AWS) Elastic MapReduce (EMR) team!EMR is a massively scaled distributed service that gives users fast and predictable Big Data performance with clusters running Hadoop, Hive, Pig, Impala, Spark, Presto, HBase and more, with the ability to effortlessly scale up and down as needed. We run millions of customer clusters, enabling processing on vast datasets.We are developing innovative new features including the next-generation cluster management system, real-time processing for big data and intuitive ways of interacting with data, and we’re looking for top engineers to build them from the ground up.This is a hands-on position where you will be do everything from designing and building extremely stable components and cutting-edge features for the savviest customers in the business to help them get the best results.You will have a chance to work with the open source community and contribute significant portions its software to open source projects possibly including Hadoop, Spark, Pig and Hbase. You need to not only be a top software developer with excellent programming skills, an understanding of big data and parallelization, and a stellar record of delivery but also excel at leadership and customer obsession and have a real passion for massive-scale computing. If you want to truly test your mettle against the hardest challenges in distributed systems to build solutions for large scale problems in a wide variety of domains, come join our group.Your responsibilities will include:Translation of complex functional and technical requirements into detailed architecture and designDeliver systems and features with top-notch quality, on timeDevelop new technologies for monitoring production clustersOwn the software development process end-to-end, including: working with engineers and product managers to develop requirements; designing, architecting, planning, implementing, and testing new systems and features; deploying, and operating the production EMR systems.In joining our team, you will get to work with a minimum of technical supervision, while playing a variety of roles as needed to respond efficiently to multiple program priorities. You will get to collaborate with some of the best and brightest minds in the industry. You'll enjoy a competitive salary, great benefits, a creative and agile work environment, and the exciting opportunity to be part of a fast-paced and growing team and one of the most innovative technology companies - but most of all, you will get the satisfaction of making products that millions use everyday to great effect!***For more information on Amazon Web Services, please visit http://aws.amazon.com ******For more information on Amazon Elastic MapReduce, please visit http://aws.amazon.com/elasticmapreduce and http://aws.amazon.com/emr-jobs***Our team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded engineer and enable them to take on more complex tasks in the future.Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.About the teamInclusive Team CultureHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.Work/Life BalanceOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.Mentorship & Career GrowthOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.", "basic_qual": "Internal Phone Tool titleSoftware Dev Engineer IIJob posting categorySoftware DevelopmentJob display languageEnglish (US)External job descriptionJob summaryWant to change the world with Big Data and Analytics? Come join us on the Amazon Web services (AWS) Elastic MapReduce (EMR) team!EMR is a massively scaled distributed service that gives users fast and predictable Big Data performance with clusters running Hadoop, Hive, Pig, Impala, Spark, Presto, HBase and more, with the ability to effortlessly scale up and down as needed. We run millions of customer clusters, enabling processing on vast datasets.We are developing innovative new features including the next-generation cluster management system, real-time processing for big data and intuitive ways of interacting with data, and we’re looking for top engineers to build them from the ground up.This is a hands-on position where you will be do everything from designing and building extremely stable components and cutting-edge features for the savviest customers in the business to help them get the best results.You will have a chance to work with the open source community and contribute significant portions its software to open source projects possibly including Hadoop, Spark, Pig and Hbase. You need to not only be a top software developer with excellent programming skills, an understanding of big data and parallelization, and a stellar record of delivery but also excel at leadership and customer obsession and have a real passion for massive-scale computing. If you want to truly test your mettle against the hardest challenges in distributed systems to build solutions for large scale problems in a wide variety of domains, come join our group.Your responsibilities will include:Translation of complex functional and technical requirements into detailed architecture and designDeliver systems and features with top-notch quality, on timeDevelop new technologies for monitoring production clustersOwn the software development process end-to-end, including: working with engineers and product managers to develop requirements; designing, architecting, planning, implementing, and testing new systems and features; deploying, and operating the production EMR systems.In joining our team, you will get to work with a minimum of technical supervision, while playing a variety of roles as needed to respond efficiently to multiple program priorities. You will get to collaborate with some of the best and brightest minds in the industry. You'll enjoy a competitive salary, great benefits, a creative and agile work environment, and the exciting opportunity to be part of a fast-paced and growing team and one of the most innovative technology companies - but most of all, you will get the satisfaction of making products that millions use everyday to great effect!***For more information on Amazon Web Services, please visit http://aws.amazon.com ******For more information on Amazon Elastic MapReduce, please visit http://aws.amazon.com/elasticmapreduce and http://aws.amazon.com/emr-jobs***Our team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded engineer and enable them to take on more complex tasks in the future.Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.About the teamInclusive Team CultureHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.Work/Life BalanceOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.Mentorship & Career GrowthOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.", "preferred_qual": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Software Development Engineer, Digital Acceleration", "url": "https://www.amazon.jobs/jobs/2919523", "location": "Bellevue, WA, USA", "updated": "Updated: 3/26/2025", "short_description": ["Would you like to help us build a large-scale Software-As-A-Service (SAAS) solution for all subscription and membership businesses at Amazon? Are you excited about building distributed systems with really"], "job_id": "Job ID: 2919523 | Amazon.com Services LLC", "full_description": "Would you like to help us build a large-scale Software-As-A-Service (SAAS) solution for all subscription and membership businesses at Amazon? Are you excited about building distributed systems with really challenging mix of requirements on availability, latency and consistency? Are you someone who enjoys the challenge of figuring out scalable and reusable technical solutions in the context of business problems with ever-growing complexity? If the answers are yes, our team will offer you all of those opportunities, so please come talk to us!We build and run mission critical commerce systems that power all subscription and membership use cases at Amazon. We are responsible for managing all aspects of a subscription's and digital ordering lifecycle at scale and providing the right extensibility in our APIs and data model to support the rapidly growing customization needs by the businesses that we support, among which are some the biggest and most complex at Amazon such as Prime world-wide and Alexa smart home subscriptions.Key job responsibilitiesAs a Software Engineer, you will lead projects involving multiple teams in all aspects of the SDLC using an agile process. As the systems need to be built from the ground up, you will have an opportunity to make a long-lasting impact! To be successful in this position you will have a strong background in Algorithms, Data Structures, Java, and NoSQL. The ability to communicate clearly and concisely (both written and orally) and work well in a team are key competencies. You should be able to quickly adapt to new development environments, learn new systems, create reliable and maintainable code, and find creative and scalable solutions to difficult problems. Experience working with high-traffic, scalable services is a plus.About the teamAmazon Digital Acceleration powers ordering, subscriptions, and device management for Prime, Amazon Video, Music, Audible, Alexa, and Kindle, amongst other digital businesses. We process billions of digital purchases every year and enable our digital businesses to grow their businesses worldwide. We are on a mission to be earth's best provider of one-time and recurring digital commerce, delivering a seamless and enjoyable post-purchase customer experience.", "basic_qual": "Would you like to help us build a large-scale Software-As-A-Service (SAAS) solution for all subscription and membership businesses at Amazon? Are you excited about building distributed systems with really challenging mix of requirements on availability, latency and consistency? Are you someone who enjoys the challenge of figuring out scalable and reusable technical solutions in the context of business problems with ever-growing complexity? If the answers are yes, our team will offer you all of those opportunities, so please come talk to us!We build and run mission critical commerce systems that power all subscription and membership use cases at Amazon. We are responsible for managing all aspects of a subscription's and digital ordering lifecycle at scale and providing the right extensibility in our APIs and data model to support the rapidly growing customization needs by the businesses that we support, among which are some the biggest and most complex at Amazon such as Prime world-wide and Alexa smart home subscriptions.Key job responsibilitiesAs a Software Engineer, you will lead projects involving multiple teams in all aspects of the SDLC using an agile process. As the systems need to be built from the ground up, you will have an opportunity to make a long-lasting impact! To be successful in this position you will have a strong background in Algorithms, Data Structures, Java, and NoSQL. The ability to communicate clearly and concisely (both written and orally) and work well in a team are key competencies. You should be able to quickly adapt to new development environments, learn new systems, create reliable and maintainable code, and find creative and scalable solutions to difficult problems. Experience working with high-traffic, scalable services is a plus.About the teamAmazon Digital Acceleration powers ordering, subscriptions, and device management for Prime, Amazon Video, Music, Audible, Alexa, and Kindle, amongst other digital businesses. We process billions of digital purchases every year and enable our digital businesses to grow their businesses worldwide. We are on a mission to be earth's best provider of one-time and recurring digital commerce, delivering a seamless and enjoyable post-purchase customer experience.", "preferred_qual": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Software Development Engineer, Ordering Platform", "url": "https://www.amazon.jobs/jobs/2938471", "location": "Seattle, WA, USA", "updated": "Updated: 3/26/2025", "short_description": ["At the heart of Amazon.com's tremendous selection, world class shopping experience, fulfillment and refund is the Ordering team. The software we write and the systems we own enable hundreds of millions"], "job_id": "Job ID: 2938471 | Amazon.com Services LLC", "full_description": "At the heart of Amazon.com's tremendous selection, world class shopping experience, fulfillment and refund is the Ordering team. The software we write and the systems we own enable hundreds of millions of customers worldwide to order anything from a pin to a piano with the click of a mouse! Every aspect of our business interacts with our systems. We're the hub of Amazon's massive, worldwide service-oriented architecture.The e-Commerce Service Group at Amazon Seattle is an agile team whose charter is to deliver the next generation of e-Commerce solutions. As a member of this team, your mission will be to design, develop, document and support massively scalable, distributed real time systems. Using Java, object oriented and service design patterns, distributed databases, and other innovative storage techniques, you will build and deliver software systems that support complex and rapidly evolving business requirements.The successful candidate is expected to contribute to all parts of the software development and deployment life-cycle, including design, development, documentation, testing and operations. They must possess strong verbal and written communication skills, be self-driven and deliver high quality results in a fast paced environment. They need to enjoy working closely with their peers in a high-performing group of very smart and talented engineers.We're looking for smart people who can get things done. The ideal candidate has a range of experience solving different engineering problems across the full tech stack.  ", "basic_qual": "At the heart of Amazon.com's tremendous selection, world class shopping experience, fulfillment and refund is the Ordering team. The software we write and the systems we own enable hundreds of millions of customers worldwide to order anything from a pin to a piano with the click of a mouse! Every aspect of our business interacts with our systems. We're the hub of Amazon's massive, worldwide service-oriented architecture.The e-Commerce Service Group at Amazon Seattle is an agile team whose charter is to deliver the next generation of e-Commerce solutions. As a member of this team, your mission will be to design, develop, document and support massively scalable, distributed real time systems. Using Java, object oriented and service design patterns, distributed databases, and other innovative storage techniques, you will build and deliver software systems that support complex and rapidly evolving business requirements.The successful candidate is expected to contribute to all parts of the software development and deployment life-cycle, including design, development, documentation, testing and operations. They must possess strong verbal and written communication skills, be self-driven and deliver high quality results in a fast paced environment. They need to enjoy working closely with their peers in a high-performing group of very smart and talented engineers.We're looking for smart people who can get things done. The ideal candidate has a range of experience solving different engineering problems across the full tech stack.  ", "preferred_qual": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Sr. Software Development Engineer, External Fulfillment Tech", "url": "https://www.amazon.jobs/jobs/2912199", "location": "Austin, TX, USA", "updated": "Updated: 3/26/2025", "short_description": ["Amazon's External Fulfillment Technology enables Amazon businesses and third party sellers and warehouse providers to run Fulfillment Centers (FCs) leveraging Amazon's expertise in fulfillment planning"], "job_id": "Job ID: 2912199 | Amazon.com Services LLC", "full_description": "Amazon's External Fulfillment Technology enables Amazon businesses and third party sellers and warehouse providers to run Fulfillment Centers (FCs) leveraging Amazon's expertise in fulfillment planning and optimization. Our team is chartered with making the Amazon Fulfillment Tech's WMS (Warehouse Management Systems) accessible and flexible for emerging markets and businesses. Our WMS enables fulfillment of millions of items WW each day.  We are investing in several new initiatives to scale our platforms, including building next generation external fulfillment solutions that expand our current footprint across third party-managed warehouses as well as Amazon fulfillment network. We are looking for a Senior Engineer who is passionate about building scalable systems in our space. In this role, you will have the opportunity to work with PEs and Sr. PEs within Fulfillment Tech and supply chain optimization. You will solve for architectural challenges in making large volumes of constantly changing data available to various applications owned by diverse customers (internal and external) and business use cases, as well as innovative solutions for managing data quality and in complex event processing. You will be empowered to think big and invent on behalf of our customers, make high judgment calls to keep teams moving and find simple solutions to hard problems. You will leverage your engineering skill set and expertise across multiple initiatives, as well as go own large projects where you get to dive deep to solve. You will influence senior business and technical leaders to deliver these critical business goals through our solutions.Key job responsibilitiesAs a Senior SDE you will be expected to: • Serve as a technical lead on our cross-functional projects. • Ensure the quality of architecture and design of systems by working independently as well as with Principal Engineers, as needed. • Functionally decompose complex problems into simple, straight-forward solutions. • Fully and completely understand system interdependencies and limitations. • Assist in the career development of others, actively mentoring individuals on technical issues and helping managers guide the career growth of junior SDEs. • Have technical influence over multiple teams, increasing their productivity and effectiveness by sharing your knowledge and experience. A day in the lifeAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:1. Medical, Dental, and Vision Coverage2. Maternity and Parental Leave Options3. Paid Time Off (PTO)4. 401(k) Plan If you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!About the teamAmazon Fulfillment Technologies (AFT) powers Amazon’s global fulfillment network. We invent and deliver software, hardware, and data science solutions that orchestrate processes, robots, machines, and people. We harmonize the physical and virtual world so Amazon customers can get what they want, when they want it.External FulfillmentAFT’s External Fulfillment team builds flexible, scalable solutions specifically designed for the needs of Amazon’s emerging markets and businesses.", "basic_qual": "Amazon's External Fulfillment Technology enables Amazon businesses and third party sellers and warehouse providers to run Fulfillment Centers (FCs) leveraging Amazon's expertise in fulfillment planning and optimization. Our team is chartered with making the Amazon Fulfillment Tech's WMS (Warehouse Management Systems) accessible and flexible for emerging markets and businesses. Our WMS enables fulfillment of millions of items WW each day.  We are investing in several new initiatives to scale our platforms, including building next generation external fulfillment solutions that expand our current footprint across third party-managed warehouses as well as Amazon fulfillment network. We are looking for a Senior Engineer who is passionate about building scalable systems in our space. In this role, you will have the opportunity to work with PEs and Sr. PEs within Fulfillment Tech and supply chain optimization. You will solve for architectural challenges in making large volumes of constantly changing data available to various applications owned by diverse customers (internal and external) and business use cases, as well as innovative solutions for managing data quality and in complex event processing. You will be empowered to think big and invent on behalf of our customers, make high judgment calls to keep teams moving and find simple solutions to hard problems. You will leverage your engineering skill set and expertise across multiple initiatives, as well as go own large projects where you get to dive deep to solve. You will influence senior business and technical leaders to deliver these critical business goals through our solutions.Key job responsibilitiesAs a Senior SDE you will be expected to: • Serve as a technical lead on our cross-functional projects. • Ensure the quality of architecture and design of systems by working independently as well as with Principal Engineers, as needed. • Functionally decompose complex problems into simple, straight-forward solutions. • Fully and completely understand system interdependencies and limitations. • Assist in the career development of others, actively mentoring individuals on technical issues and helping managers guide the career growth of junior SDEs. • Have technical influence over multiple teams, increasing their productivity and effectiveness by sharing your knowledge and experience. A day in the lifeAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:1. Medical, Dental, and Vision Coverage2. Maternity and Parental Leave Options3. Paid Time Off (PTO)4. 401(k) Plan If you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!About the teamAmazon Fulfillment Technologies (AFT) powers Amazon’s global fulfillment network. We invent and deliver software, hardware, and data science solutions that orchestrate processes, robots, machines, and people. We harmonize the physical and virtual world so Amazon customers can get what they want, when they want it.External FulfillmentAFT’s External Fulfillment team builds flexible, scalable solutions specifically designed for the needs of Amazon’s emerging markets and businesses.", "preferred_qual": "- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner."},
{"title": "Software Development Engineer, Live Sports - Prime Video", "url": "https://www.amazon.jobs/jobs/2938872", "location": "Arlington, VA, USA", "updated": "Updated: 3/26/2025", "short_description": ["Want to change the way people watch Live Sports? Passionate about building, owning and operating massively scalable systems?  Looking forward to work with a team of highly competent software engineers"], "job_id": "Job ID: 2938872 | Amazon.com Services LLC", "full_description": "Want to change the way people watch Live Sports? Passionate about building, owning and operating massively scalable systems?  Looking forward to work with a team of highly competent software engineers ranging from new graduates to seasoned architects building software using the latest AWS technologies? Are you looking for an inclusive team, where you feel safe to be yourself, to share your ideas openly, to experiment, fail and learn, and where you help make decisions that shape the team’s path forward? If so, here is an opportunity tailored for you.  Who we are?We are the Prime Video Live Events team, revolutionize the way our customers search, discover and enjoy live events from sports, to music, to breaking news and political debates. In September 2018 we launched our first full-scale live streaming experience to all of our world-wide Prime customers with NFL’s Thursday Night Football. In just a year, we delivered multi-game watching experience to our Prime Video customers in UK for English Premier League . That was just the start. We are expanding and looking for engineers to build innovative solutions for customer to discover engaging and personalized live content to enjoy. This is a transformative opportunity, the chance to be at the vanguard of a program that will revolutionize Prime Video, and the live streaming experience for customers everywhere. Our team is building a wide variety of services from low-latency, high-TPS services that control the lifecycle of live events and help customers discover live or upcoming games on variety of devices including Alexa and to engage customer on Prime Video content offline and through social-media platforms. If you’re a strong engineer, there’s a home for you in Prime Video Live Events.  Our leaders are great teachers, our engineers are world-class, and our products are fun. What will you do?We are looking for smart, motivated Software Development Engineers who can help in building personalized discovery experience for thousands of live streaming events available world-wide using technologies like machine learning. If you have experience building large-scale, high-performance, customer-friendly products and are interested in designing and implementing distributed systems to handle large datasets, complex domains, and problems at Amazon scale, this is the job for you. This is an exciting role, offering a customer-obsessed engineer to learn and use a broad array of technologies to make a real impact. Our architecture leverages the latest in AWS cloud technologies including EC2, S3, DynamoDB, Kinesis, and Cloudfront in supporting billions of requests from millions of Prime Video users. If you’re excited about helping to build the future of live event streaming or just want to have fun creating something you can be proud to show your family and friends, reach out. We’d love to chat.", "basic_qual": "Want to change the way people watch Live Sports? Passionate about building, owning and operating massively scalable systems?  Looking forward to work with a team of highly competent software engineers ranging from new graduates to seasoned architects building software using the latest AWS technologies? Are you looking for an inclusive team, where you feel safe to be yourself, to share your ideas openly, to experiment, fail and learn, and where you help make decisions that shape the team’s path forward? If so, here is an opportunity tailored for you.  Who we are?We are the Prime Video Live Events team, revolutionize the way our customers search, discover and enjoy live events from sports, to music, to breaking news and political debates. In September 2018 we launched our first full-scale live streaming experience to all of our world-wide Prime customers with NFL’s Thursday Night Football. In just a year, we delivered multi-game watching experience to our Prime Video customers in UK for English Premier League . That was just the start. We are expanding and looking for engineers to build innovative solutions for customer to discover engaging and personalized live content to enjoy. This is a transformative opportunity, the chance to be at the vanguard of a program that will revolutionize Prime Video, and the live streaming experience for customers everywhere. Our team is building a wide variety of services from low-latency, high-TPS services that control the lifecycle of live events and help customers discover live or upcoming games on variety of devices including Alexa and to engage customer on Prime Video content offline and through social-media platforms. If you’re a strong engineer, there’s a home for you in Prime Video Live Events.  Our leaders are great teachers, our engineers are world-class, and our products are fun. What will you do?We are looking for smart, motivated Software Development Engineers who can help in building personalized discovery experience for thousands of live streaming events available world-wide using technologies like machine learning. If you have experience building large-scale, high-performance, customer-friendly products and are interested in designing and implementing distributed systems to handle large datasets, complex domains, and problems at Amazon scale, this is the job for you. This is an exciting role, offering a customer-obsessed engineer to learn and use a broad array of technologies to make a real impact. Our architecture leverages the latest in AWS cloud technologies including EC2, S3, DynamoDB, Kinesis, and Cloudfront in supporting billions of requests from millions of Prime Video users. If you’re excited about helping to build the future of live event streaming or just want to have fun creating something you can be proud to show your family and friends, reach out. We’d love to chat.", "preferred_qual": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Software Development Engineer, Search - Prime Video", "url": "https://www.amazon.jobs/jobs/2938870", "location": "Arlington, VA, USA", "updated": "Updated: 3/26/2025", "short_description": ["Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing"], "job_id": "Job ID: 2938870 | Amazon.com Services LLC", "full_description": "Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.Within Prime Video, the Search Engineering team is making a step change in the look, feel and quality of our Search experience. We are standing up a brand new Search Engine that need to handle 1B+ requests every month. We are innovating with leading-edge Machine Learning technologies like Large Language Models including Retrieval-Augmented Generation techniques, and developing net new Named Entity Recognition and Natural Language Understanding models.If you are ready to truly make an impact on a product that is used by millions of people around the world, including your own friends and family, then we would love to talk to you.Key job responsibilities- Directly interfacing with product managers and other stake holders to build features that help new customer experience for Prime Video.- Create end to end solutions and execute via software engineering design, development, and ultimately helping millions of Prime Video customers.- We work with customer facing products that are highly visible and on initiatives that directly impact PV goals of increasing customer activity on the platform. - We use Machine Learning to analyze the customer's behavior to infer what they would be most likely to watch and recommend content that is highly relevant.A day in the lifeAs a member of the team, you will spend your time as a hands-on engineer and a technical leader. You will play a key role in building software products and features from the ground up. You will use a wide range of technologies, programming languages and systems. Your responsibilities will include all aspects of software development. You will work with Data Scientists to build Personalization and Recommender systems. You will be given the freedom and inspiration to explore your own ideas and the reward of seeing your contributions benefit millions of Amazon.com customers worldwide.About the team- We are a team of engineers that focuses on solving customer problems with a diverse cultural mindset.- We drive to create a team culture of leaders that are able to shine as individuals and as a team.", "basic_qual": "Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.Within Prime Video, the Search Engineering team is making a step change in the look, feel and quality of our Search experience. We are standing up a brand new Search Engine that need to handle 1B+ requests every month. We are innovating with leading-edge Machine Learning technologies like Large Language Models including Retrieval-Augmented Generation techniques, and developing net new Named Entity Recognition and Natural Language Understanding models.If you are ready to truly make an impact on a product that is used by millions of people around the world, including your own friends and family, then we would love to talk to you.Key job responsibilities- Directly interfacing with product managers and other stake holders to build features that help new customer experience for Prime Video.- Create end to end solutions and execute via software engineering design, development, and ultimately helping millions of Prime Video customers.- We work with customer facing products that are highly visible and on initiatives that directly impact PV goals of increasing customer activity on the platform. - We use Machine Learning to analyze the customer's behavior to infer what they would be most likely to watch and recommend content that is highly relevant.A day in the lifeAs a member of the team, you will spend your time as a hands-on engineer and a technical leader. You will play a key role in building software products and features from the ground up. You will use a wide range of technologies, programming languages and systems. Your responsibilities will include all aspects of software development. You will work with Data Scientists to build Personalization and Recommender systems. You will be given the freedom and inspiration to explore your own ideas and the reward of seeing your contributions benefit millions of Amazon.com customers worldwide.About the team- We are a team of engineers that focuses on solving customer problems with a diverse cultural mindset.- We drive to create a team culture of leaders that are able to shine as individuals and as a team.", "preferred_qual": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Software Development Engineer, People eXperience and Technology (PXT)", "url": "https://www.amazon.jobs/jobs/2938869", "location": "Bellevue, WA, USA", "updated": "Updated: 3/26/2025", "short_description": ["We are the People eXperience Technology (PXT), responsible for providing the software products that 1.5 million Amazonians use daily to manage their career and that of their teams, find information when"], "job_id": "Job ID: 2938869 | Amazon.com Services LLC", "full_description": "We are the People eXperience Technology (PXT), responsible for providing the software products that 1.5 million Amazonians use daily to manage their career and that of their teams, find information when they need it and remain connected to life at Amazon. We build products based on the latest AWS and third-party technologies powered by data insights, machine learning and smart automation. At PXT we serve Amazonians through a human-centered design approach to technology innovation with the goal of supporting Amazon’s mission to be Earth’s best employer.As a Software Engineer you will participate in the design, implementation, and deployment of highly scalable, architecturally sound products for daily global use by Amazonians. You will work in cross-functional teams and learn how to solve complex problems.Are you passionate about developing products that scale and perform at high availability using AWS technologies? Do you have the customer obsession to build experiences serving hundreds of thousands of Amazon employees daily? If so, come build with us!Key job responsibilities- Responsible for the end-to-end design, development, test, implementation of complex problems including planning, risk, trade-offs.- Guide and ensure quality of architectural decisions across products and teams.- Work with customers, technical staff, business leaders to define and deliver complex features.- Identify and pursue opportunities for integrations across the org and outside to deliver for our customers.- Help establish the long-term success strategy for your systems, development best practices, and operational excellence processes.About the teamYou will be joining the A to Z team within PXT. A to Z serves as the ingress for PXT (People Experience and Technology) applications. It offers both a mobile app and a web interface, catering to different employee needs. A to Z streamlines employee experiences by offering a unified, user-friendly interface for essential work-related tasks and information.", "basic_qual": "We are the People eXperience Technology (PXT), responsible for providing the software products that 1.5 million Amazonians use daily to manage their career and that of their teams, find information when they need it and remain connected to life at Amazon. We build products based on the latest AWS and third-party technologies powered by data insights, machine learning and smart automation. At PXT we serve Amazonians through a human-centered design approach to technology innovation with the goal of supporting Amazon’s mission to be Earth’s best employer.As a Software Engineer you will participate in the design, implementation, and deployment of highly scalable, architecturally sound products for daily global use by Amazonians. You will work in cross-functional teams and learn how to solve complex problems.Are you passionate about developing products that scale and perform at high availability using AWS technologies? Do you have the customer obsession to build experiences serving hundreds of thousands of Amazon employees daily? If so, come build with us!Key job responsibilities- Responsible for the end-to-end design, development, test, implementation of complex problems including planning, risk, trade-offs.- Guide and ensure quality of architectural decisions across products and teams.- Work with customers, technical staff, business leaders to define and deliver complex features.- Identify and pursue opportunities for integrations across the org and outside to deliver for our customers.- Help establish the long-term success strategy for your systems, development best practices, and operational excellence processes.About the teamYou will be joining the A to Z team within PXT. A to Z serves as the ingress for PXT (People Experience and Technology) applications. It offers both a mobile app and a web interface, catering to different employee needs. A to Z streamlines employee experiences by offering a unified, user-friendly interface for essential work-related tasks and information.", "preferred_qual": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."},
{"title": "Software Development Engineer, Amazon Robotics Autonomous Mobility", "url": "https://www.amazon.jobs/jobs/2938849", "location": "North Reading, MA, USA", "updated": "Updated: 3/26/2025", "short_description": ["The Amazon Robotics Autonomous Mobility software team develops the software that powers Proteus, Amazon’s first fully autonomous warehouse robot. We are growing and are looking for an enthusiastic Software"], "job_id": "Job ID: 2938849 | Amazon.com Services LLC", "full_description": "The Amazon Robotics Autonomous Mobility software team develops the software that powers Proteus, Amazon’s first fully autonomous warehouse robot. We are growing and are looking for an enthusiastic Software Development Engineer to join our Platform, Data and Tools team. You will be part of an exceptional, collaborative group of engineers building the platform and architecture for our onboard mapping, perception, motion planning and control software. In addition, you will collaborate with engineers and scientists across the team to develop and enhance our ML training and deployment pipelines.Key job responsibilitiesSpecific areas of focus may include (but are not limited too):• Optimizing runtime performance of core algorithms by exploiting underlying hardware acceleration capabilities• Integrating new sensors and hardware components into the software stack• Developing and customizing our Nvidia Jetpack based platform and OS.• Building data pipelines and tools to enable our ML-development flywheel• Developing software to enable remote diagnostics, recovery and control of autonomous robots• Building visualization tools for analyzing and debugging robot behavior • Designing and developing software interfaces to enable hardware testing and manufacturing processes.A day in the lifeAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include: 1. Medical, Dental, and Vision Coverage 2. Maternity and Parental Leave Options 3. Paid Time Off (PTO) 4. 401(k) Plan   If you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!About the teamWe are a multi-disciplinary team of collaborative Applied Scientists and Software Engineers with expertise in Computer Vision, SLAM, motion planning and controls. Our mission is to deliver autonomous navigation software that utilizes state-of-the-art sensor technologies and algorithms to enable safe and efficient operation of autonomous mobile robots throughout the Amazon fulfillment and transportation network. We take this mission seriously and work hard to achieve it, but we have a lot of fun along the way. After all, what's more fun than building robots?", "basic_qual": "The Amazon Robotics Autonomous Mobility software team develops the software that powers Proteus, Amazon’s first fully autonomous warehouse robot. We are growing and are looking for an enthusiastic Software Development Engineer to join our Platform, Data and Tools team. You will be part of an exceptional, collaborative group of engineers building the platform and architecture for our onboard mapping, perception, motion planning and control software. In addition, you will collaborate with engineers and scientists across the team to develop and enhance our ML training and deployment pipelines.Key job responsibilitiesSpecific areas of focus may include (but are not limited too):• Optimizing runtime performance of core algorithms by exploiting underlying hardware acceleration capabilities• Integrating new sensors and hardware components into the software stack• Developing and customizing our Nvidia Jetpack based platform and OS.• Building data pipelines and tools to enable our ML-development flywheel• Developing software to enable remote diagnostics, recovery and control of autonomous robots• Building visualization tools for analyzing and debugging robot behavior • Designing and developing software interfaces to enable hardware testing and manufacturing processes.A day in the lifeAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include: 1. Medical, Dental, and Vision Coverage 2. Maternity and Parental Leave Options 3. Paid Time Off (PTO) 4. 401(k) Plan   If you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!About the teamWe are a multi-disciplinary team of collaborative Applied Scientists and Software Engineers with expertise in Computer Vision, SLAM, motion planning and controls. Our mission is to deliver autonomous navigation software that utilizes state-of-the-art sensor technologies and algorithms to enable safe and efficient operation of autonomous mobile robots throughout the Amazon fulfillment and transportation network. We take this mission seriously and work hard to achieve it, but we have a lot of fun along the way. After all, what's more fun than building robots?", "preferred_qual": "- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience- Bachelor's degree in computer science or equivalent- Experience developing software for real-time and embedded systems- Experience with Linux kernel and OS setup and configuration- Device driver development- Experience with ROS- Experience with ML frameworks such has AWS Sagemaker, Pytorch, and MLFlow.- Experience with NVIDIA JetPack SDK and related technologies- Experience with Yocto- GPU development experience- Experience building and maintaining developer-facing tools- Experience with AWS services and technologiesAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner."},
{"title": "Software Engineer - Ads", "url": "https://www.amazon.jobs/jobs/2908616", "location": "San Francisco, CA, USA", "updated": "Updated: 3/26/2025", "short_description": ["If you are interested in this position, please apply on Twitch's Career site https://www.twitch.tv/jobs/en/About Us:Twitch is the world’s biggest live streaming service, with global communities built around"], "job_id": "Job ID: 2908616 | Twitch Interactive, Inc.", "full_description": "If you are interested in this position, please apply on Twitch's Career site https://www.twitch.tv/jobs/en/About Us:Twitch is the world’s biggest live streaming service, with global communities built around gaming, entertainment, music, sports, cooking, and more. It is where thousands of communities come together for whatever, every day.We’re about community, inside and out. You’ll find coworkers who are eager to team up, collaborate, and smash (or elegantly solve) problems together. We’re on a quest to empower live communities, so if this sounds good to you, see what we’re up to on LinkedIn and X,  and discover the projects we’re solving on our Blog. Be sure to explore our Interviewing Guide to learn how to ace our interview process.About the RoleThe Twitch Ads team manages a comprehensive advertising ecosystem that balances revenue generation with user satisfaction. We deliver promotional content through multiple channels while maintaining seamless experiences for both viewers and creators. Our team owns critical ad services - from request handling to delivery - and integrates with Amazon's broader advertising infrastructure. These technical implementations drive essential business operations while preserving Twitch's unique viewer-creator relationship. You will be reporting to the Senior Engineering Manager of the Ads Team and working closely with the Engineers within the Twitch Ads and Amazon Ads orgs. You will be working on building products and features to support unlocking exciting new ads functionality and opportunities. This position is in San Francisco, CA.You Will- Work with product managers, technical leads, and other engineers to design, develop, launch, and operate interactive experiences- Build distributed applications at scale- Collaborate with both your team and related teams - fostering shared understanding of how to solve common problems and deliver solutions- Work backwards from customer problems to drive business impactPerks- Medical, Dental, Vision & Disability Insurance- 401(k)- Maternity & Parental Leave- Flexible PTO- Amazon Employee Discount", "basic_qual": "If you are interested in this position, please apply on Twitch's Career site https://www.twitch.tv/jobs/en/About Us:Twitch is the world’s biggest live streaming service, with global communities built around gaming, entertainment, music, sports, cooking, and more. It is where thousands of communities come together for whatever, every day.We’re about community, inside and out. You’ll find coworkers who are eager to team up, collaborate, and smash (or elegantly solve) problems together. We’re on a quest to empower live communities, so if this sounds good to you, see what we’re up to on LinkedIn and X,  and discover the projects we’re solving on our Blog. Be sure to explore our Interviewing Guide to learn how to ace our interview process.About the RoleThe Twitch Ads team manages a comprehensive advertising ecosystem that balances revenue generation with user satisfaction. We deliver promotional content through multiple channels while maintaining seamless experiences for both viewers and creators. Our team owns critical ad services - from request handling to delivery - and integrates with Amazon's broader advertising infrastructure. These technical implementations drive essential business operations while preserving Twitch's unique viewer-creator relationship. You will be reporting to the Senior Engineering Manager of the Ads Team and working closely with the Engineers within the Twitch Ads and Amazon Ads orgs. You will be working on building products and features to support unlocking exciting new ads functionality and opportunities. This position is in San Francisco, CA.You Will- Work with product managers, technical leads, and other engineers to design, develop, launch, and operate interactive experiences- Build distributed applications at scale- Collaborate with both your team and related teams - fostering shared understanding of how to solve common problems and deliver solutions- Work backwards from customer problems to drive business impactPerks- Medical, Dental, Vision & Disability Insurance- 401(k)- Maternity & Parental Leave- Flexible PTO- Amazon Employee Discount", "preferred_qual": "- Experience with languages/frameworks we use at Twitch: Golang, Typescript/React- Experience building software and services using AWS technologies such as ECS, DynamoDB, Lambda, SQS, and Step Functions- Familiarity with Twitch, gaming, and/or streaming on TwitchWe are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, or disability status, or other legally protected status.Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $99,500/year in our lowest geographic market up to $200,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."}
]